// Header 공지 marquee로 변경?

// 검색창 클릭하면 텍스트박스 글씨 사라지게
// 검색창 hover(X) 클릭했을때 텍스트박스 다시 흰색으로 바뀌게
// 검색창 클릭하면 인기 검색어 / 검색 내역 / 추천 검색어 등의 정보 포함된 상자 팝업
// 검색 돋보기 아이콘 클릭해도 검색어 입력에 포커스 가도록

// @media screen and (max-width: 768px) ~ 360 사이
// //navbar 중앙 디자인 너무 허전? -> 추가할만한거 있는지
// // Header 공지 width:360 주변에서 글씨 두 줄로 변경되는데 글씨 크기 작게 하는걸로는 해결 불가능
// // -> display:none으로 변경하고 관련 내용을 navbar에 넣거나 미디어쿼리에서만 li > a 태그 개수 줄이기 (가장 중요한 내용 한 개만 나오게)

// 서랍 메뉴는 우측 중상단쪽에 인덱스처럼 img 띄움
// 클릭해서 열고 닫기
// 서랍 메뉴 배경 불투명하게
// box grid 형식으로 [대분류] 3*2열정도 배치, 각 대분류 안에 서브카테고리
// 대분류랑 서브카테고리는 텍스트 색상 다르게 줘서 구분 -> 대분류 색을 튀는 색, 서브는 무난한색 주기

// 상품들 + 프로모션 + 행사 + 광고 등 슬라이드로 쉭쉭 지나가게
// 슬라이드 바 또는 점 아이콘 클릭 통해서 특정 인덱스로 이동하는거 넣기

// 화면 일정 영역 스크롤 시 맨위로 이동하는 버튼 보이게 만들고, 클릭하면 맨 위로 이동
// 맨 아래로 버튼도 가능? (버튼 클릭 시 -> [scrollTop = html 전체 문서 높이 - 화면 높이] ....? 맞나...?)

// 한샘처럼 상품 목록은 일부 몇개만 보여주고 위에 광고 + 더보기버튼으로 더 많은 상품 목록 있는 창으로 넘어가기
// 광고 setInterval 사용해서 계속 넘어가게 (아님 marquee인가...?)

// 마켓비
// 까사미아





// 프로젝트 기획안 / 발표용 ppt -> 포폴로 사용
// HTML CSS JS jQuery + (Bootstrap 쓸 줄 안다는 것 어필할 정도만 사용)

// 미디어쿼리 360 이하 구현해야 함
// 미디어쿼리 폰트 크기들 가변단위로 변경할 수 있으면 해보기

// 패럴랙스?
// 제이쿼리로 애니메이션도 좀 넣기
// 배우거 최대한 다양하고 많이 들어가게
// 은근 사소한것들 하나하나 신경써서 구현하기

// 파비콘

// 서브 페이지
// 마이페이지 아이콘 눌렀을 때 로그인 되어 있다면 마이페이지로, 아니라면 로그인 창 출력
// [로그인] -> 회원가입으로 넘어갈 수 있어야 함
// [회원가입] -> 이케아처럼 입력창 테두리 없는 디자인 이쁜듯 + placeholder로 입력되어있던 데이터 입력란에 포커스 주면 사라지는듯 위로 올라가게
// // 약관 모두 동의 체크박스
// 까사미아처럼 멤버십 회원 어쩌구 광고
// 찜 목록
// 장바구니

// footer에 브랜드 인스타, 페북, 유튜브, 카톡채널 아이콘 링크
// 언어 선택..? 가능..?
